Repository: Dr-Ohoud/SENSi_LLM_Mentoring
Catalog: Localizable.xcstrings
Source language: en
Languages: ar

# %lld out of %lld steps
source: %1$lld out of %2$lld steps
ar: %1$lld من اصل %2$lld خطوة

# %lld/%lld Points
source: %1$lld/%2$lld Points
ar: %1$lld/%2$lld نقطة

source: 0 Tasks Completed
ar: 0 مهمة مكتملة

source: Account
ar: الحساب

source: Add
ar: إضافة

source: Add Your Skills
ar: إضافة مهاراتك

source: All steps complete!
ar: جميع الخطوات مكتملة!

source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Are you sure you want to delete this milestone?
ar: هل انت متاكد من حذف خطة الانجاز ؟

source: Cancel
ar: الغاء

source: Career Aspirations
ar: الطموح الوظيفي

source: Career Plan
ar: الخطة الوظيفية

source: Delete
ar: حذف

source: Don't have an account?
ar: ليس لديك حساب؟

source: Edit Profile
ar: تعديل الملف الشخصي

source: Edit Title
ar: تعديل العنوان

source: Education Level
ar: المستوى التعليمي

source: Email
ar: البريد الالكتروني

source: Email Address
ar: البريد الالكتروني

source: Email or Password is incorrect
ar: يبدو أن هناك خطأ في البريد الإلكتروني أو كلمة المرور. حاول مرة أخرى.

source: Enter a skill
ar: أضف مهارة

source: Enter your Email
ar: أدخل بريدك الإلكتروني

source: Enter your Password
ar: أدخل كلمة المرور

source: Experience Level
ar: مستواك المهني

source: Failed to create user, Try Again
ar: تعذّر إنشاء المستخدم، يرجى المحاولة مجددًا

source: General Information
ar: البيانات العامة

source: Get Started
ar: ابدأ الآن

source: Got it!
ar: حسنًا!

source: Help Your Mentor get to know you by writing a short letter
ar: عرِّف مرشدك عليك برسالة قصيرة

source: Login Error
ar: خطأ في تسجيل الدخول

source: Mailstones Plan
ar: خطة خطوات الانجاز

source: Mark Complete
ar: تعيين كمكتمل

source: Mentor is typing...
ar: المُرشد يكتب…

source: Milestone Plan
ar: خطة الانجاز

source: Milstone could not be saved. Please try again.
ar: تعذّر حفظ خطوة الانجاز. يُرجى المحاولة مرة أخرى

source: My Mailstones
ar: خطوات انجازي

source: Next
ar: التالي

source: No message to undo
ar: لا توجد رسائل للتراجع

source: No Milestone Found
ar: لاتوجد خطوات انجاز

source: OK
ar: حسنًا

source: One more thing
ar: أمر آخر

source: Password
ar: كلمة المرور

source: Password must be at least 6 characters.
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

source: Personalized Guidance, Just for You
ar: إرشاد شخصي مخصص لك

source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صالح

source: Registration Error
ar: خطأ في التسجيل

source: Registration Form
ar: نموذج إنشاء الحساب

source: Regsitration Page
ar: صفحة التسجيل

source: Save
ar: حفظ

source: Saving Milestone Error
ar: خطأ في حفظ خطوات الانجاز

source: SENSI gives you: Career advice tailored to your goals Milestones to help you take action Skill gap insights to grow faster
ar: تقدم لك SENSI: •نصائح مهنية مُصممة خصيصًا لأهدافك •معالم تساعدك على اتخاذ الإجراءات •رؤى حول فجوات المهارات لتنمو بشكل أسرع

source: SENSI is loading...
ar: جاري تحميل SENSI...

source: SENSI Mentor
ar: مرشد SENSI

source: SENSI not understand your question?
ar: SENSI لم تفهم عليك ؟

source: Sign In
ar: تسجيل الدخول

source: SIGN IN
ar: تسجيل الدخول

source: Sign out
ar: تسجيل الخروج

source: Sign Up
ar: إنشاء حساب

source: SIGN UP
ar: إنشاء حساب

source: Signup Failed
ar: تعذّر إنشاء الحساب

source: Skip
ar: تخطي

source: Steps to Complete
ar: الخطوات المطلوب إتمامها

source: Text your mentor to get started
ar: أرسل رسالة نصية إلى مرشدك للبدء

source: There is an error registering your account. Please try again.
ar: حدث خطأ أثناء إنشاء الحساب. يرجى المحاولة مرة أخرى

source: This will delete your last message and SENSI's response so you can rephrase your question or intent.
ar: يؤدي هذا إلى حذف رسالتك الأخيرة وردّ SENSI حتى تتمكن من إعادة صياغة سؤالك .

source: Type a message...
ar: اكتب رسالة…

source: Undo Messages
ar: التراجع عن الرسائل

source: User Background
ar: نبذة عن المستخدم

source: Welcome to SENSI
ar: مرحبًا بك في SENSI

source: What is your Career Goal ?
ar: ما هو هدفك المهني؟

source: What is your education level ?
ar: ما هو مستواك التعليمي؟

source: What is your experience level ?
ar: ما هو مستوى خبرتك؟

source: What is your Interests ?
ar: ما هي اهتماماتك؟

source: What is your Skill Gap you want to improve?
ar: ما هي المهارات التي ترغب في تحسينها؟

source: Would you like me to save this plan as a milestone to track progress and review later?
ar: هل تريد حفظ هذه الخطة كخطوة انجاز لمتابعة التقدم ومراجعتها لاحقًا؟

source: You can only add up to 5 skills.
ar: يمكنك إضافة 5 مهارات كحد أقصى

source: Your personal career mentor — designed to guide you step-by-step through your learning and growth journey.
ar: مرشدك المهني الشخصي — مُصمّم ليرافقك خطوة بخطوة في رحلة تعلمك وتطورك.

source: Your Skills
ar: مهاراتك
